start_text = """
Привет!  Я помогу создавать контент из любых идей и голосовых сообщений.

Отправьте мне:
• Голосовое сообщение (русский или английский)
• Текстовую заметку
•  Ссылку на статью

Я могу:
• Создать сценарий для reels
• Написать пост для Instagram, Telegram, Threads или статью
• Собрать смысловую раскладку  на 9–12 постов
• Перевести текст 🇷🇺 ⇄ 🇬🇧
• Подобрать заголовок
• Внести правки в текст и выдать обновлённую версию 
Всё автоматически и за минуту.

🎯 Команды:
/pay - Подписка и тарифы
/promo - Ввод промокода 
/language - Изменить язык
/help - Помощь 
Чтобы активировать доступ — выберите ниже:

💳 Оформить подписку или 
🎁 Активировать промокод
"""

help_text = """
📚 Справка 

🎯 Основные команды:
• /start — начало работы
• /pay — подписка и оплата
• /promo — активировать промокод
• /language — изменить язык (RU/EN)
• /help — помощь и поддержка


💡 Как использовать:


🎤 Голосовые сообщения:
• Максимум 120 секунд
• Автоматическая транскрипция 
• Бот сам распознаёт смыслы и предлагает подходящую структуру

🔗 Работа с текстами и ссылками:
• Автоматическое извлечение контента
• Обработка статей иблогов

🗂 Сетка контента:
• Формирует 9–12 постов по выбранным темам
• Делит контент на смысловые столпы: экспертность, личное, продукт
• Подходит для планирования ленты на месяц
• Можно редактировать темы и формулировки прямо в чате

💰 Тарифы и доступ:
• Trial: 3 дня бесплатного доступа ко всем функциям (через промокод /promo)
• Pro: 549 ₽ / месяц — безлимит генераций, сетки, переводы, правки и обновления
• Yearly: 5449 ₽ / год — со скидкой 33%


❓ Поддержка:
Остались вопросы? @support_username — свяжитесь с нами или /support
"""
pay_text = """Выберите тариф подписки"""

promo_text = """
Введите промокод.
"""

rigth_promocde_text = """
Промокод успешно активирован! Ваша подписка активна.
С чего хотите начать?
"""
not_right_promocode_text = """
Промокод недействителен или истёк
"""
generate_command_text = """
Запиши голосовое сообщение или отправь текст и я превращу его в сценарий или пост
"""
chose_language_text = """
🌐 Выберите язык интерфейса

Текущий язык: Русский
"""
ru_text = """
Язык интерфейса изменен на 🇷🇺Русский 
Возврат к главному меню: /start
"""
eu_text = """
Interface language changed to 🇬🇧 English
Возврат к главному меню: /start
"""
send_text_or_voice_text = """
Супер! Запиши голосовое сообщение или отправь текст и я превращу его в сценарий или пост
"""
reels_text = """
Отлично! Какой сценарий написать?
Выберите формат ролика:
• История или инсайт — личный опыт, мысли
• Продающий Reels — фокус на продукт, услугу или оффер
• На мое усмотрение
"""
reels_language_text = """
🌐 Выберите язык для генерации
"""
instagram_text = """
Instagram

🌐 Выберите язык для генерации поста
"""
threads_text = """
Threads

🌐 Выберите язык для генерации поста
"""
article_text = """
Статья

🌐 Выберите язык для генерации поста
"""
telegram_text = """
Telegram

🌐 Выберите язык для генерации поста
"""
